app/controllers/api/v1/courses_controller.rb

SELECT "courses"."topic" FROM "courses"
---
  def topics
    @courses = Course.all
    @topics = @courses.pluck(:topic).uniq

SELECT "courses".* FROM "courses" WHERE "courses"."topic" = $1 LIMIT $2  [["topic", "ti"], ["LIMIT", 1]]
---
  def topic
    @courses = Course.where(topic: @topic)

SELECT "courses"."subtopic" FROM "courses"
---
  def subtopics
    @courses = Course.all
    @subtopics = @courses.pluck(:subtopic).uniq

SELECT "courses".* FROM "courses" WHERE "courses"."subtopic" = $1  [["subtopic", "banco de dados"]]
---
  def subtopic
    @courses = Course.where(subtopic: @subtopic.humanize.downcase)

INSERT INTO "courses" ("title", "topic", "subtopic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Amazon AWS"], ["topic", "TI"], ["subtopic", "infraestrutura"], ["created_at", "2023-08-09 22:08:20.225971"], ["updated_at", "2023-08-09 22:08:20.225971"]]
---
  def create
    @course = Course.new(course_params)

    if @course.save

UPDATE "courses" SET "title" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["title", "mysqlworkbench"], ["updated_at", "2023-04-21 04:12:44.225190"], ["id", 3]]
---
  def update
    if @course.update(course_params)