app/controllers/api/v1/courses_controller.rb

INSERT INTO "courses" ("title", "topic", "subtopic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "rails 7"], ["topic", "TI"], ["subtopic", "desenvolvimento web"], ["created_at", "2023-04-21 04:04:09.955891"], ["updated_at", "2023-04-21 04:04:09.955891"]]
---
  def create
    @course = Course.new(course_params)

    if @course.save

UPDATE "courses" SET "title" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["title", "mysqlworkbench"], ["updated_at", "2023-04-21 04:12:44.225190"], ["id", 3]]
---
  def update
    if @course.update(course_params)