app/controllers/api/v1/users_controller.rb

  def getone
  	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
	  user = User.find(params[:id])
	  user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2, "title" = $3 WHERE "users"."id" = $4  [["email", "achan@test.com"], ["updated_at", "2023-04-16 15:24:54.124970"], ["title", "a-chan"], ["id", 1]]