app/controllers/chapters_controller.rb

  def index
    @chapters = Chapter.all
---
SELECT "chapters".* FROM "chapters"

  def show_from_course
    @chapters = Chapter.where(course_id: params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."course_id" = ?  [["course_id", 1]]

  def create
    @chapter = Chapter.new(chapter_params)

    if @chapter.save
---
INSERT INTO "chapters" ("title", "number", "content", "created_at", "updated_at", "course_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @chapter.update(chapter_params)
---
UPDATE "chapters" SET "content" = ?, "updated_at" = ? WHERE "chapters"."id" = ?  [["content", "Segundo tem que ir lá e fazer isso aqui v"], ["updated_at", "2023-06-29 23:59:33.780151"], ["id", 1]]

  def destroy
    @chapter.destroy
---
DELETE FROM "chapters" WHERE "chapters"."id" = ?  [["id", 15]]

    def set_chapter
      @chapter = Chapter.find(params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]